# Exercise 4.5

In [15]:
#import libraries
import pandas as pd
import numpy as np
import os

In [16]:
#assign path of the dataframes to a variable 'path'
path=r'C:\Users\19452\Desktop\Seema\Careerfoundry-Data Analytics Course\Work Area\Python Fundamentals\Nov-2023 Instacart Basket Analysis\02 Data'

# import products dataframe from original folder
df_prods=pd.read_csv(os.path.join(path,'Original Data','products.csv'),index_col=False)

# import orders_wrangled dataframe from prepared folder
df_ords=pd.read_csv(os.path.join(path,'Prepared Data','orders_wrangled.csv'),index_col=False)

## Step 1: Consistency checks

## Address Mixed data-types

In [17]:
# create a dataframe

df_test=pd.DataFrame()

# create a mixed type column

df_test['mix']=['a','b',1, True]

df_test.head()

    mix
0     a
1     b
2     1
3  True

In [18]:
# The function for checking whether a dataframe contains any mixed-type columns is as follows:
# weird= (df_test[[col]].applymap(type)!=df_test[[col]].iloc[0].apply(type)).any(axis=1) -- This line gives error, 
# so changed applymap to map

for col in df_test.columns.tolist():
    weird= (df_test[[col]].map(type)!=df_test[[col]].iloc[0].apply(type)).any(axis=1)
    if len (df_test[weird])>0:
        print (col)

mix

In [19]:
# this will convert a column’s data type from numeric to string

df_test['mix']=df_test['mix'].astype('str')

# Missing Values

In [20]:
# Find missing values in products dataframe
# The output shows there are 16 missing values in product_name colum

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [21]:
# to view 16 observations with missing values, you can create a subset of the dataframe 
# containing only the values in question

df_nan=df_prods[df_prods['product_name'].isnull()==True]

In [22]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [26]:
# df.describe()

# df['column with missings'].fillna(mean value, inplace=True)

# df_prods.median()

# df['column with missings'].fillna(median value, inplace=True)

In [27]:
# Check the number of rows and columns before clean up
df_prods.shape

(49693, 5)

In [29]:
# extract only the observations from df_prods where product_name column is not blank and store it in a new dataframe
# df_prods_clean

df_prods_clean= df_prods[df_prods['product_name'].isnull() == False]

In [30]:
# Check the number of rows and columns in the new dataframe with extracted records after clean up

df_prods_clean.shape

(49677, 5)

In [ ]:
#  drop all missing values from df_prods 

# df_prods.dropna(inplace=True)

# If you wanted to drop only the NaNs from a particular column.  Inplace=True with replace the existing dataframe with new.

# df_prods.dropna(subset='product_name',inplace=True)

In [31]:
# extract duplicate observations from df_prods_clean and store it in dataframe df_dups

df_dups=df_prods_clean[df_prods_clean.duplicated()]

In [32]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [33]:
df_prods_clean.shape

(49677, 5)

In [34]:
# remove duplicates from df_prods_clean dataframe and store the results in df_prods_clean_no_dups

df_prods_clean_no_dups=df_prods_clean.drop_duplicates()

In [37]:
df_prods_clean_no_dups.shape

(49672, 5)

In [39]:
# export df_prods_clean_no_dups to prepared data folder as a new file products_checked.csv

df_prods_clean_no_dups.to_csv(os.path.join(path,'Prepared Data', 'products_checked.csv'))

# Task 4.5

## Step 2

## order_number has min and max values as 1. Lower quartile and Upper quartile values are 5 and 2. 
## The max value here should have been 5.

## days_since_prior_order column has min 0 and max 3. Where as median is 7.  There is a discrepancy in max value here.

In [43]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## Step 3 - Check for mixed data-type columns

In [60]:
# Check whether df_ords contain mixed-type column

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)
else :
    print ("None of the columns have mix data")

None of the columns have mix data

## Step 4 - No mixed data-type columns found

## Step 5 - days_since_prior_order column has 206209 missing values

In [53]:
# Check if there are any missing values in df_ords dataframe

df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

## Step 6 - Since there are 206209 observations with missing values, it's not safe to delete them.  Also imputing a large amount of values could lead to wrong analysis.  Thus I think it's best to extract the observations that are not null into a new dataframe.

In [67]:
# df_ords dataframe has 3421083 observations including null values in days_since_prior_order

df_ords.shape

(3421083, 7)

In [73]:
## extract all the missing value observations to a new dataframe

df_ords_missing_values=df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [74]:
# Look at the contents of new dataframe 

df_ords_no_missing_values

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [76]:
# investigate further on NaN values in days_since_prior_order dataframe

df_ords['days_since_prior_order'].value_counts(dropna=False)

days_since_prior_order
30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: count, dtype: int64

In [81]:
df_ords['order_number'].value_counts(dropna=False).head(20)

order_number
1     206209
2     206209
3     206209
4     206209
5     182223
6     162633
7     146468
8     132618
9     120918
10    110728
11    101696
12     93881
13     86929
14     80693
15     75080
16     69889
17     65296
18     61157
19     57321
20     53931
Name: count, dtype: int64

## Step 7

In [ ]:
# check for duplicate values in df_ords